window.roads = [
  // {
  //   id: "r1",
  //   name: "Level 1 - 主干示例",
  //   level: 1,
  //   min_zoom: 1,   // 可选：最小显示缩放
  //   max_zoom: 7,   // 可选：最大显示缩放
  //   points: [
  //     { x: 200, y: 200 },
  //     { x: 800, y: 260 },
  //     { x: 1500, y: 320 }
  //   ]
  // },
  // {
  //   id: "r2",
  //   name: "Level 2 - 次干示例",
  //   level: 2,
  //   min_zoom: 3,   // 可选：最小显示缩放
  //   max_zoom: 7,   // 可选：最大显示缩放
  //   points: [
  //     { x: 700, y: 900 },
  //     { x: 900, y: 650 },
  //     { x: 1100, y: 420 }
  //   ]
  // },
  // {
  //   id: "r3",
  //   name: "Level 3 - 支路示例",
  //   level: 3,
  //   min_zoom: 5,   // 可选：最小显示缩放
  //   max_zoom: 7,   // 可选：最大显示缩放
  //   points: [
  //     { x: 1180, y: 680 },
  //     { x: 1260, y: 720 },
  //     { x: 1360, y: 760 }
  //   ]
  // }
];
